Revit 2024 API
SpatialFieldManager.SetResultSchema Method
 Sets a new value for an existing result schema in the result registry
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetResultSchema(
	int idx,
	AnalysisResultSchema resultSchema
)
Visual Basic
Public Sub SetResultSchema ( _
	idx As Integer, _
	resultSchema As AnalysisResultSchema _
)
Visual C++
public:
void SetResultSchema(
	int idx,
	AnalysisResultSchema^ resultSchema
)
Parameters
idx
Type: System.Int32
 Index of registered result schema
resultSchema
Type: Autodesk.Revit.DB.Analysis.AnalysisResultSchema
 Result schema replacing the existent one
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  idx refers to non-existent result schema -or- name of resultSchema is not unique in view
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace